dic ={"result": [{"时间": "2019年2月中旬", "地点": "微信", "人物": ["金红涛", "兰兵"], "物品": ["毒品"]}, {"时间": "2019年2月20日", "地点": "湖北省武汉市江夏区五里界圆通快递点", "人物": ["金红涛", "兰兵"], "物品": ["甲基苯丙胺"]}, {"时间": "2月24日", "地点": "珠海市圆通快递代办点领取快递并各自取回所", "人物": ["金红涛"], "物品": ["甲基苯丙胺"]}, {"时间": "2019年2月27日", "地点": "珠海市派酒店门口", "人物": ["金红涛"], "物品": ["毒品", "甲基苯丙胺并通过微信转账1600元"]}, {"时间": "2019年2月27日20时30分", "地点": "上述地点并将该毒品", "人物": ["金红涛"], "物品": ["该毒品"]}]}
thing=[]
res={}
for event in dic['result']:
    people = event['人物']
    for person in people:
        _u = res.get(person)
        if _u is None:
            res[person] = [event['物品']]
        else:
            _u.append(event['物品'])
            res[person] = _u

print(res)

